list1 = ['小明', 18, 1.70]
print(list1)

students = ['小明', '小红', '小刚']
print(students[0])
# : 的使用着重复习

# 现在，请你把小美加入students列表中，并打印出列表，注意格式是列表名.append( )
students = ['小明', '小红', '小刚']
print(students)
students.append('小美')
print(students)

# 请你根据上图中的知识，补全下面的代码，将'小红'从列表中删除，并打印出来：（语法是：del 列表名[元素的索引]）
students = ['小明', '小红', '小刚', '小美']
del students[1]
print(students)

scores = {'小明': 95, '小红': 90, '小刚': 90}
print(scores['小红'])

scores = {'小明': 95, '小红': 90, '小刚': 90}
print(scores)
scores['小刚'] = 92
scores['小美'] = 85
print(scores)

# 从列表中取出小兰，并打印出来吧
students = [['小明', '小红', '小刚', '小美'], ['小强', '小兰', '小伟', '小芳']]
print(students[1][1])

# 请你仔细观察上面的代码，然后尝试取出小刚的成绩。
scores = {
    '第一组': {'小明': 95, '小红': 90, '小刚': 100, '小美': 85},
    '第二组': {'小强': 99, '小兰': 89, '小伟': 93, '小芳': 88}
}
print(scores['第一组']['小刚'])

# 最外层是大括号，所以是字典嵌套列表，先找到字典的键对应的列表，再判断列表中要取出元素的偏移量
students = {
    '第一组': ['小明', '小红', '小刚', '小美'],
    '第二组': ['小强', '小兰', '小伟', '小芳']
}
print(students['第一组'][3])
# 取出'第一组'对应列表偏移量为3的元素，即'小美'

# 最外层是中括号，所以是列表嵌套字典，先判断字典是列表的第几个元素，再找出要取出的值相对应的键
scores = [
    {'小明': 95, '小红': 90, '小刚': 100, '小美': 85},
    {'小强': 99, '小兰': 89, '小伟': 93, '小芳': 88}
]
print(scores[1]['小强'])
# 先定位到列表偏移量为1的元素，即第二个字典，再取出字典里键为'小强'对应的值，即99。

# 请在下列代码基础上 1.打印出字典students里的小刚 2.打印出列表scores里小刚的分数100。
students = {
    '第一组': ['小明', '小红', '小刚', '小美'],
    '第二组': ['小强', '小兰', '小伟', '小芳']
}
scores = [
    {'小明': 95, '小红': 90, '小刚': 100, '小美': 85},
    {'小强': 99, '小兰': 89, '小伟': 93, '小芳': 88}
]
print(students['第一组'][2])
print(scores[0]['小刚'])

# =========================练习=========================
list1 = [{'嫉妒': 'envy'}, {'恨': 'hatred'}, {'爱': 'love'}]
print(list1[2]['爱'])

# 第一步：取出列表中的第三个元素（list1[2]），字典{'爱':'love'}；
# 第二步：取出list1[2]中键'爱'所对应的值，即'love’（list1[2]['爱']）。


dict1 = {1: ['cake', 'scone', 'puff'], 2: ['London', 'Bristol', 'Bath'], 3: ['love', 'hatred', 'envy']}
print(dict1[3][0])

# 第一步：取出字典中键为3对应的值（dict1[3]），即['love','hatred','envy']。
# 第二步：再取出列表['love','hatred','envy']中的第一个元素（dict1[3][0]）。

tuple1 = ('A', 'B')
list2 = [('A', 'B'), ('C', 'D'), ('E', 'F')]

print(tuple1[0])
print(list2[1][1])

# 从代码里，也可看出：1.元组内数据的提取也是用偏移量；2.元组也支持互相嵌套。


# aa
